#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Oct 25 17:12:09 2023

remove_constraint  -logic -fdc "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/video_stitching.fdc"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Camera_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/DDR3_interface_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/video_stitching.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Camera_top/cam_data_converter.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Camera_top/ov5640_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Camera_top/sccb_driver.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/DDR3_interface_top/AXI_rw_FIFO.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/DDR3_interface_top/simplified_AXI.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top/iic_dri.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top/ms72xx_init.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top/ms7200_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top/ms7210_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/HDMI_top/video_driver.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/DDR3_interface_top/arbiter.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Video_processing_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Video_processing_top/bilinear_calculator.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Video_processing_top/bilinear_interpolation.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Video_processing_top/image_2x2.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/arp.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/gmii_to_rgmii.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/udp_rx.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/arp/arp_rx.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/arp/arp_tx.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/arp/crc32_d8.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/gmii_to_rgmii/rgmii_rx.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/rtl/Ethernet_top/gmii_to_rgmii/rgmii_tx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Camera_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/DDR3_interface_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/video_stitching_scaling.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Camera_top/cam_data_converter.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Camera_top/ov5640_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Camera_top/sccb_driver.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/DDR3_interface_top/arbiter.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/DDR3_interface_top/AXI_rw_FIFO.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/DDR3_interface_top/simplified_AXI.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/arp.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/gmii_to_rgmii.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/udp_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/arp/arp_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/arp/arp_tx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/arp/crc32_d8.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/gmii_to_rgmii/rgmii_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Ethernet_top/gmii_to_rgmii/rgmii_tx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/iic_dri.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/ms72xx_init.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/ms7200_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/ms7210_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/video_driver.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_2x2.v"
add_constraint "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/video_stitching_scaling.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/HDMI_top/video_display.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/bilinear_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/bilinear_interpolation.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/image_2x2.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_calculator.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_2x2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/bilinear_interpolation_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/divider.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/input_ram_matrix.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/video_processing_controller.v"
add_design D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/ipcore/ram_s_d_2048x8/ram_s_d_2048x8.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/ipcore/fifo_4096x8/fifo_4096x8.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/ipcore/mul_add_u8_u9_u8_u9/mul_add_u8_u9_u8_u9.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/ipcore/mul_add_u9_u16_u9_u16/mul_add_u9_u16_u9_u16.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/bilinear_calculator.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/bilinear_interpolation.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_reduce_x2/image_2x2.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/bilinear_interpolation_calculator.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/divider.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/input_ram_matrix.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation_scaler/video_processing_controller.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/bilinear_interpolation.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top/image_2x2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top_1.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top_1/bilinear_interpolation_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top_1/divider.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top_1/input_ram_matrix.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Video_processing_top_1/video_processing_controller.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/rtl/Controller.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching_scaling_v1/pango_project/ipcore/pll/pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching_scaling
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
